# Group By

In [1]:
import pandas as pd

In [2]:
data = pd.DataFrame({ "Classe": ["Júnior", "Júnior", "Pleno", "Pleno", "Sênior", "Sênior"], 
                      "Nome": ["Jorge", "Carlos", "Roberta", "Mariana", "Alice", "Juliana"],
                      "Venda": [200, 120, 340, 124, 243, 350]})

In [3]:
data

   Classe     Nome  Venda
0  Júnior    Jorge    200
1  Júnior   Carlos    120
2   Pleno  Roberta    340
3   Pleno  Mariana    124
4  Sênior    Alice    243
5  Sênior  Juliana    350

In [8]:
data.groupby("Classe")["Venda"].sum()

Classe
Júnior    320
Pleno     464
Sênior    593
Name: Venda, dtype: int64

In [10]:
data.groupby("Classe").sum(numeric_only=True)

        Venda
Classe
Júnior    320
Pleno     464
Sênior    593

In [11]:
data.groupby("Classe").mean(numeric_only=True)

        Venda
Classe
Júnior  160.0
Pleno   232.0
Sênior  296.5

In [14]:
data.groupby("Classe").min()

           Nome  Venda
Classe
Júnior   Carlos    120
Pleno   Mariana    124
Sênior    Alice    243

In [15]:
data.groupby("Classe").max()

           Nome  Venda
Classe
Júnior    Jorge    200
Pleno   Roberta    340
Sênior  Juliana    350

In [17]:
dataframe = data.copy()

In [19]:
data

   Classe     Nome  Venda
0  Júnior    Jorge    200
1  Júnior   Carlos    120
2   Pleno  Roberta    340
3   Pleno  Mariana    124
4  Sênior    Alice    243
5  Sênior  Juliana    350

In [18]:
dataframe

   Classe     Nome  Venda
0  Júnior    Jorge    200
1  Júnior   Carlos    120
2   Pleno  Roberta    340
3   Pleno  Mariana    124
4  Sênior    Alice    243
5  Sênior  Juliana    350

In [20]:
dataframe["Venda"] = [150, 432, 190, 230, 410, 155]

In [21]:
dataframe

   Classe     Nome  Venda
0  Júnior    Jorge    150
1  Júnior   Carlos    432
2   Pleno  Roberta    190
3   Pleno  Mariana    230
4  Sênior    Alice    410
5  Sênior  Juliana    155

In [22]:
data

   Classe     Nome  Venda
0  Júnior    Jorge    200
1  Júnior   Carlos    120
2   Pleno  Roberta    340
3   Pleno  Mariana    124
4  Sênior    Alice    243
5  Sênior  Juliana    350

In [24]:
dataframe2 = pd.concat([data, dataframe])

In [25]:
dataframe2

   Classe     Nome  Venda
0  Júnior    Jorge    200
1  Júnior   Carlos    120
2   Pleno  Roberta    340
3   Pleno  Mariana    124
4  Sênior    Alice    243
5  Sênior  Juliana    350
0  Júnior    Jorge    150
1  Júnior   Carlos    432
2   Pleno  Roberta    190
3   Pleno  Mariana    230
4  Sênior    Alice    410
5  Sênior  Juliana    155

In [29]:
dataframe2.groupby(["Classe", "Nome"]).min()

                Venda
Classe Nome
Júnior Carlos     120
       Jorge      150
Pleno  Mariana    124
       Roberta    190
Sênior Alice      243
       Juliana    155

In [30]:
dataframe2.groupby(["Classe", "Nome"]).max()

                Venda
Classe Nome
Júnior Carlos     432
       Jorge      200
Pleno  Mariana    230
       Roberta    340
Sênior Alice      410
       Juliana    350

In [31]:
dataframe2.groupby(["Classe", "Nome"]).sum()

                Venda
Classe Nome
Júnior Carlos     552
       Jorge      350
Pleno  Mariana    354
       Roberta    530
Sênior Alice      653
       Juliana    505

In [32]:
dataframe2.groupby(["Classe", "Nome"]).mean()

                Venda
Classe Nome
Júnior Carlos   276.0
       Jorge    175.0
Pleno  Mariana  177.0
       Roberta  265.0
Sênior Alice    326.5
       Juliana  252.5